/* Вывести на экран число с точностью до сотых. */
//console.log(3,141);

/*Вывести на экран число e (основание натурального логарифма) с точностью
до десятых.*/
//console.log(2,71);

/*Составить программу вывода на экран числа, вводимого с клавиатуры.
 Выводимому числу должно предшествовать сообщение "Вы ввели число". */
 //let num = prompt('Введите число');
 //alert('Вы ввели число ' + num);

 /*Составить программу вывода на экран числа, вводимого с клавиатуры. После выводимого числа 
 должно следовать сообщение " - вот какое число Вы ввели". */
 //num = prompt('Введите число');
 //alert(num + ' - вот какое число Вы ввели');

 /*Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.*/
 //console.log(1+' '+13+' '+49);

 /*Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.*/
 //console.log(7+'  '+15+'  '+100);

 /*Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.*/
 //let num1 = prompt('Введите 1 число');
 //let num2 = prompt('Введите 2 число');
 //let num3 = prompt('Введите 3 число');
 //alert(num1+'  '+num2+'  '+num3);

 /*Составить программу вывода на экран в одну строку четырех любых чисел
с одним пробелом между ними.*/
 //let num1 = prompt('Введите 1 число');
 //let num2 = prompt('Введите 2 число');
 //let num3 = prompt('Введите 3 число');
 //let num4 = prompt('Введите 4 число');
 //alert(num1+' '+num2+' '+num3+' '+num4);

 /*Вывести на экран числа 50 и 10 одно под другим.*/
 //console.log(50);
 //console.log(10);

 /*Вывести на экран числа 5, 10 и 21 одно под другим.*/
 //console.log(5);
 //console.log(10);
 //console.log(21);

 /* Составить программу вывода на экран "столбиком" четырех любых чисел.*/
 //console.log(5);
 //console.log(10);
 //console.log(21);
 //console.log(51);

 /*Записать по правилам изучаемого языка программирования следующие выражения:*/
//let x = 2;
//let y = 4;
//console.log(2 * x);
//console.log(Math.sin(x));
//console.log(Math.sqrt(x));
//console.log(Math.abs(x));
//console.log(5 * Math.cos(y));
//console.log(3 * Math.sqrt(x));
